* testing it out [2014-08-24 Sun]

#+BEGIN_SRC emacs-lisp
(setq org-agenda-files
	      (f--entries "." (string= (file-name-extension it) "org")))
;; open all notebook files
	(dolist (f org-agenda-files)
	  (find-file-noselect f))
#+END_SRC

#+RESULTS:
nil
(([2014-08-23 Sat] . #<marker at 16 in f1.org>) ([2014-08-16 Sat] . #<marker at 71 in f1.org>))




#+BEGIN_SRC emacs-lisp :results raw
(on-jump-to-most-recent-timestamp)
#+END_SRC

#+RESULTS:
([2014-08-23 Sat] . #<marker at 16 in f1.org>)

